ProgessBase/DataProcessors/ПТЛ_ПодборРейсовВОтчетВыполненныхПеревозок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>ПТЛ_ПодборРейсовВОтчетВыполненныхПеревозок</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НСИ_Отделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтчетОВыполненнойПеревозке</Name>
					<Type>
						<v8:Type>cfg:DocumentObject.ПТЛ_ОтчетОВыполненнойПеревозке</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НезакрытыеРейсы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Отметить</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОтгрузки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДобавленоВОтчет</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Рейс</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПТЛ_Рейсы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Маршрут</Name>
							<Comment>Изменяется в плане доставки</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ПТЛ_Маршруты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПланДоставки</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПТЛ_ПланДоставки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТЭК</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипТранспорта</Name>
							<Comment>Может отличаться от заказа</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ПТЛ_ТипыТранспортныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТранспортноеСредство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПТЛ_ТранспортныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Водитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПТЛ_Водители</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВесБрутто</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Объем</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоМест</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоТочек</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтоимостьПеревозки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗаданияНаПеревозкуПоРейсам</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Рейс</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПТЛ_Рейсы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОтгрузки</Name>
							<Comment>Может отличаться от даты в заказе</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаДоставки</Name>
							<Comment>Может отличатся от даты в заказе</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерЗадания</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>11</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаданиеНаПеревозку</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПТЛ_ЗаданиеНаПеревозку</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусДокумента</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПТЛ_СтатусыЗаданияНаПеревозку</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОперации</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СП_ВидыОперацииЗаданияНаПодбор</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УсловиеПоставки</Name>
							<Comment>Из заказа, не меняется</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.ПТЛ_УсловияПоставки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Comment>Из заказа, не меняется</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Получатель</Name>
							<Comment>Из заказа, не меняется</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Регионы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГородДоставки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НСИ_Города</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Округ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НСИ_Округа</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Район</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НСИ_Районы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресПоставки</Name>
							<Comment>Из заказа, не меняется</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.АдресаПоставки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Объем</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоМест</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПаллетоМест</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ответственный</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заказ</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
								<v8:Type>cfg:DocumentRef.ВнутреннийЗаказ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаданиеНаПодбор</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.СП_ЗаданиеНаПодбор</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Накладная</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ТребованиеНакладная</v8:Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТЭК</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Водитель</Name>
							<Comment>Изменяется в плане доставки</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ПТЛ_Водители</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТранспортноеСредство</Name>
							<Comment>Изменяется в плане доставки</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ПТЛ_ТранспортныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

ProgessBase/Enums/СП_ВидыОперацииЗаданияНаПодбор.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>СП_ВидыОперацииЗаданияНаПодбор</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОтгрузкаКлиенту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещениеНаСклад</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоставкаОтПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещениеОтКопекера</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещениеККопекеру</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ProgessBase/DataProcessors/ПТЛ_ПодборРейсовВОтчетВыполненныхПеревозок/Ext/ManagerModule.bsl
Функция ПолучитьДанныеПоНезакрытымРейсам(ДатаС, ДатаПо, мОрганизация, мОтделение, мДокумент) Экспорт
	
	//Blik 240817 65458 н
	СписокИсключенийПоВидуОперации = Новый СписокЗначений;
	СписокИсключенийПоВидуОперации.Добавить(Перечисления.СП_ВидыОперацииЗаданияНаПодбор.ПеремещениеОтКопекера);
	СписокИсключенийПоВидуОперации.Добавить(Перечисления.СП_ВидыОперацииЗаданияНаПодбор.ПеремещениеККопекеру);
	СписокИсключенийПоВидуОперации.Добавить(Перечисления.СП_ВидыОперацииЗаданияНаПодбор.ДоставкаОтПоставщика);
	//Blik 240817 65458 к
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ПТЛ_ПланДоставки.Отделение,
	               |	ПТЛ_ПланДоставки.ДатаОтгрузки,
	               |	ПТЛ_ПланДоставки.Рейс,
	               |	ПТЛ_ПланДоставки.ПланДоставки,
	               |	СУММА(ПТЛ_ПланДоставки.Вес) КАК Вес,
	               |	СУММА(ПТЛ_ПланДоставки.ВесБрутто) КАК ВесБрутто,
	               |	СУММА(ПТЛ_ПланДоставки.Объем) КАК Объем,
	               |	СУММА(ПТЛ_ПланДоставки.КоличествоМест) КАК КоличествоМест,
	               |	СУММА(ПТЛ_ПланДоставки.КоличествоПаллетоМест) КАК КоличествоПаллетоМест,
	               |	СУММА(ПТЛ_ПланДоставки.КоличествоПозиций) КАК КоличествоПозиций,
	               |	МАКСИМУМ(ПТЛ_ПланДоставки.Стоимость) КАК СтоимостьПеревозки,
	               |	ПТЛ_ПланДоставки.Маршрут,
	               |	ПТЛ_ПланДоставки.ТЭК,
	               |	ПТЛ_ПланДоставки.Водитель,
	               |	ПТЛ_ПланДоставки.ТранспортноеСредство,
	               |	ПТЛ_ПланДоставки.ТранспортноеСредство.ТипТранспорта КАК ТипТранспорта,
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПТЛ_ПланДоставки.ЗаданиеНаПеревозку.АдресПоставки) КАК КоличествоТочек,
	               |	ПТЛ_ПланДоставки.ЗаданиеНаПеревозку,
	               |	ПТЛ_ПланДоставки.ЗаданиеНаПодбор,
	               |	ПТЛ_ПланДоставки.ДатаДоставки
	               |ПОМЕСТИТЬ ТабПлан
	               |ИЗ
	               |	РегистрНакопления.ПТЛ_ПланДоставки КАК ПТЛ_ПланДоставки
	               |ГДЕ
	               |	ПТЛ_ПланДоставки.Регистратор ССЫЛКА Документ.ПТЛ_ПланДоставки
	               |	И ПТЛ_ПланДоставки.Исключено = ЛОЖЬ
	               |	И ПТЛ_ПланДоставки.ДатаОтгрузки МЕЖДУ &ДатаНач И &ДатаКон
	               |	И ПТЛ_ПланДоставки.Отделение = &Отделение
	               |	И ПТЛ_ПланДоставки.ПланДоставки.Организация = &Организация
				   //Blik 240817 65458 н
				   // Шевченков 62064 20170207
				   //И ПТЛ_ПланДоставки.ЗаданиеНаПеревозку.ВидОперации <> Значение(Перечисление.СП_ВидыОперацииЗаданияНаПодбор.ДоставкаОтПоставщика) 
				   //
				   |	И НЕ ПТЛ_ПланДоставки.ЗаданиеНаПеревозку.ВидОперации В (&СписокИсключенийВидовОпераций)
				   //Blik 240817 65458 к
				   |
	               |СГРУППИРОВАТЬ ПО
	               |	ПТЛ_ПланДоставки.Отделение,
	               |	ПТЛ_ПланДоставки.ДатаОтгрузки,
	               |	ПТЛ_ПланДоставки.Рейс,
	               |	ПТЛ_ПланДоставки.ПланДоставки,
	               |	ПТЛ_ПланДоставки.Маршрут,
	               |	ПТЛ_ПланДоставки.ТЭК,
	               |	ПТЛ_ПланДоставки.Водитель,
	               |	ПТЛ_ПланДоставки.ТранспортноеСредство,
	               |	ПТЛ_ПланДоставки.ТранспортноеСредство.ТипТранспорта,
	               |	ПТЛ_ПланДоставки.ЗаданиеНаПеревозку,
	               |	ПТЛ_ПланДоставки.ЗаданиеНаПодбор,
	               |	ПТЛ_ПланДоставки.ДатаДоставки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТабПлан.Отделение,
	               |	ТабПлан.ДатаОтгрузки,
	               |	ТабПлан.Рейс,
	               |	ТабПлан.ПланДоставки,
	               |	ТабПлан.Вес,
	               |	ТабПлан.ВесБрутто,
	               |	ТабПлан.Объем,
	               |	ТабПлан.КоличествоМест,
	               |	ТабПлан.КоличествоПаллетоМест,
	               |	ТабПлан.КоличествоПозиций,
	               |	ТабПлан.СтоимостьПеревозки,
	               |	ТабПлан.Маршрут,
	               |	ТабПлан.ТЭК,
	               |	ТабПлан.Водитель,
	               |	ТабПлан.ТранспортноеСредство,
	               |	ТабПлан.ТипТранспорта,
	               |	ТабПлан.КоличествоТочек,
	               |	ТабПлан.ЗаданиеНаПеревозку,
	               |	ТабПлан.ЗаданиеНаПодбор,
	               |	ТабПлан.ДатаДоставки,
	               |	ВЫБОР
	               |		КОГДА ПТЛ_ОтчетОВыполненнойПеревозкеМаршруты.Ссылка ЕСТЬ NULL 
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ ИСТИНА
	               |	КОНЕЦ КАК Выполнено
	               |ИЗ
	               |	ТабПлан КАК ТабПлан
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПТЛ_ОтчетОВыполненнойПеревозке.Маршруты КАК ПТЛ_ОтчетОВыполненнойПеревозкеМаршруты
	               |		ПО ТабПлан.ПланДоставки = ПТЛ_ОтчетОВыполненнойПеревозкеМаршруты.ПланДоставки
	               |			И ТабПлан.Рейс = ПТЛ_ОтчетОВыполненнойПеревозкеМаршруты.Рейс
	               |			И (ПТЛ_ОтчетОВыполненнойПеревозкеМаршруты.Ссылка.Проведен = ИСТИНА)
				   |			И (НЕ ПТЛ_ОтчетОВыполненнойПеревозкеМаршруты.Ссылка = &Ссылка)
	               |ГДЕ
	               |	ПТЛ_ОтчетОВыполненнойПеревозкеМаршруты.Ссылка ЕСТЬ NULL 				   
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ТабПлан";
	
		
	Запрос.УстановитьПараметр("ДатаКон"		, КонецДня(ДатаПо));
	Запрос.УстановитьПараметр("ДатаНач"		, НачалоДня(ДатаС));
	Запрос.УстановитьПараметр("Организация"	, мОрганизация);
	Запрос.УстановитьПараметр("Отделение"	, мОтделение);
	Запрос.УстановитьПараметр("Ссылка"	, мДокумент);
	//Blik 240817 65458 н
	Запрос.УстановитьПараметр("СписокИсключенийВидовОпераций"	, СписокИсключенийПоВидуОперации);
	//Blik 240817 65458 к
	
	РезультатЗапроса = Запрос.Выполнить();
	
	тзРезультат = РезультатЗапроса.Выгрузить();
	
	//Если НЕ РезультатЗапроса.Пустой() Тогда
	//	тзРезультат = РезультатЗапроса.Выгрузить();
	//	
	//	Возврат тзРезультат;
	// КонецЕсли;

	Возврат тзРезультат;//Новый ТаблицаЗначений;
	
КонецФункции
